In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
db_warehouse = create_engine('postgresql://marcel:4UTebmZgDs7Hyfsq@warehouse:5433/warehouse')
db_replication = create_engine('postgresql://francois:4RzVZ2JmndK@db-slave2:5432/lottostar')

In [2]:
sql_query="""
 SELECT
     sum(f.price) AS entry_price,
     sum(f.winnings) AS winnings,
     date_trunc('day', f.created_at) as bet_date
    FROM
     play_entry f,
     game_event g
   WHERE
f.event_id = g.id AND
 g.draw_datetime >= '2018-02-01 00:00:00' and g.draw_datetime < '2018-03-01 00:00:00' and winnings > 0 group by 3 order by 3;
"""

In [3]:
df1 = pd.read_sql_query(sql_query, con=db_warehouse)
df2 = pd.read_sql_query(sql_query, con=db_replication)

In [4]:
df1.to_csv('warehouse_bet_values.csv')
df2.to_csv('replication_bet_values.csv')

In [5]:
df2.tail()

     entry_price  winnings                  bet_date
100    166739.95  469779.9 2018-02-23 22:00:00+00:00
101    157986.90  423889.8 2018-02-24 22:00:00+00:00
102    148432.30  434406.8 2018-02-25 22:00:00+00:00
103    174672.35  513654.4 2018-02-26 22:00:00+00:00
104    171972.50  453658.3 2018-02-27 22:00:00+00:00

In [6]:
df1.tail()

     entry_price  winnings                  bet_date
100    166739.95  469779.9 2018-02-23 22:00:00+00:00
101    157986.90  423889.8 2018-02-24 22:00:00+00:00
102    148432.30  434406.8 2018-02-25 22:00:00+00:00
103    174672.35  513654.4 2018-02-26 22:00:00+00:00
104    171972.50  453658.3 2018-02-27 22:00:00+00:00

In [7]:
df1['entry_price'].sum() == df2['entry_price'].sum()

True

In [8]:
df1['winnings'].sum() == df2['winnings'].sum()

True

In [9]:
df1['entry_price_diff'] = df1['entry_price'] - df2['entry_price']

In [10]:
df1[df1['entry_price_diff'] != 0]

Empty DataFrame
Columns: [entry_price, winnings, bet_date, entry_price_diff]
Index: []

In [11]:
diff_total = df1['entry_price_diff'].sum()

In [12]:
df1['winnings_diff'] = df1['winnings'] - df2['winnings']

In [13]:
df1['winnings_diff'].sum()

0.0